Revit 2027 API
ParameterTypeId.StructuralDisplayInHiddenViewsFraming Property
 "Display in Hidden Views"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId StructuralDisplayInHiddenViewsFraming { get; }
Public Shared ReadOnly Property StructuralDisplayInHiddenViewsFraming As ForgeTypeId
	Get
public:
static property ForgeTypeId^ StructuralDisplayInHiddenViewsFraming {
	ForgeTypeId^ get ();
}
static member StructuralDisplayInHiddenViewsFraming : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace